<details ><summary>apply for monitoring 2024-12-25 15:32:54 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # module.prometheus.module.prometheus_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.prometheus.module.prometheus_deployment.akash_deployment.service: Creating...
module.prometheus.module.prometheus_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.prometheus.module.prometheus_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.prometheus.module.prometheus_deployment.akash_deployment.service: Creation complete after 21s [id=19509345:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>
</details>